---
kind: property
id: P:Autodesk.Revit.DB.TessellatedShapeBuilderResult.AreObjectsAvailable
source: html/ea616568-4dc6-0ea7-8bf9-f0d91d4fca66.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilderResult.AreObjectsAvailable Property

Shows whether 'issues' still contains the original data or whether
 these data have already been relinquished by 'getGeometricalObjects'.
 The former is true, the later is false.

## Syntax (C#)
```csharp
public bool AreObjectsAvailable { get; }
```